import React, { useState } from 'react';
import Card from '@mui/material/Card';
import CardActions from '@mui/material/CardActions';
import CardContent from '@mui/material/CardContent';
import CardMedia from '@mui/material/CardMedia';
import Button from '@mui/material/Button';
import Typography from '@mui/material/Typography';
import { Collapse, Grid, Stack } from '@mui/material';

export default function ImgMediaCard() {
    const [isExpanded, setIsExpanded] = useState(false);
    const [isExpanded1, setIsExpanded1] = useState(false);
    const [isExpanded2, setIsExpanded2] = useState(false);
    const [isExpanded3, setIsExpanded3] = useState(false);
    return (
        <Stack direction="row" gap={5} flexWrap={'wrap'} justifyContent={"center"}>
            <Grid container spacing={3}>
            <Grid item xs={12} md={6}>
            <Card sx={{ minWidth: '35%' }}>
                <CardMedia
                    component="img"
                    alt="green iguana"
                    height="300"
                    image="images/رحلتك.jpg"
                />
                <CardContent>
                    <Typography gutterBottom variant="h5" component="div">
                        * أفضل الاماكن السياحية في برشلونة...
                    </Typography>
                    <Typography gutterBottom variant="p" component="p">
                        تعتبر مدينة برشلونة هي الوجهة الأكثر شعبية في اسبانيا بسبب ماتتمتع به من مقومات سياحية كثيرة ومناظر خلابة تجذب الزوار اليها وسنقوم فيما يلي بعرض لافضل الاماكن السياحية التي يمكن زيارتها.

                    </Typography>
                </CardContent>
                <CardActions sx={{ display: "flex", justifyContent: "space-between" }}>
                    <Button size="small" sx={{ color: "#1473E6" }} onClick={() => setIsExpanded(!isExpanded)}>قراءة المزيد</Button>
                </CardActions>
                <Collapse
                    in={isExpanded}
                    timeout="auto"
                    unmountOnExit
                >
                    <CardContent>
                        <Typography>
                        - " حديقة جويل" :-
                        - تحفة معمارية من تصميم المهندس المعماري الكاتالوني " انتوني غاودي " وتعتبر من اجمل الاماكن السياحية في برشلونة ويحتوي مجموعة من الحدائق وينصح بزيارته علي وجه الخصوص ويمكن ان تبدأ نهارك فيه بجولة في ارجاء الحديقة والاستمتاع بمساحتها الخضراء والمنحوتات ذات الطراز الفريد وتيتح الحديقة مناظر بانورامية تفوق الجمال الدخول هناك مجانيا ويوجد ايضا مقاهي ومطعم ومتجر للهدايا وحمامات عامة.
                        2- " حديقة حيوان برشلونة":
                        - تعتبر من أبرز المعالم السياحية باقليم كاتالونيا وموجود بها اكثر من 4 الاف حيوان " النمور, الاسود، الافيال، الدببة ،الغزلان " وتعتبر خيار ممتاز لمن يبحث عن مكان سياحي للاطفال ويمكنك عمل جولة استكشافية للاستمتاع بالمساحات الخضراء حول ارجاء الحديقة والتعرف علي الحيوانات الموجودة والطيور الجميلة التي تجذب الزوار.
                        وحدود المتعة لاتنتهي عند المشاهدة فقط ولكن يمكن التفاعل ايضا مع الحيوانات والتقاط الصور معهم.

                            - " ملاهي ايلا فانتاسيا المائية ":-
                            عند زيارتك برشلونة يتوجب عليك الذهاب الي هذة الملاهي لانها تعتبر مكان رائع يوجد به بعض الالعاب الشيقة علي مساحات واسعة ويوجد بها ايضا بعض الاماكن المخصصة للشواء ومطاعم ومقاهي متنوعة ويتوفر بها كافة وسائل المتعة.
                            4- " منتزة كوزموكايك " :-
                            يسمي متحف العلوم في مدينة برشلونة ويعد واحد من اهم المتاحف المتنوعة يحتوي اربع اقسام بها معارض مختلفة " قسم الغالات المغمورة، حائط بيولوجي ، غرفة مواد، قبة سماوية " .
                            يمكنك من قضاء وقت ترفيهي وتعليمي في ذات الوقت ويعرض المعلومات بطريقة غريبة واسلوب تفاعلي وشيق ومناسب لجميع الفئات العمرية.
                            ويوجد في برشلونة الكثير من الاماكن السياحية الاخري والترفيهية التي يمكن زيارتها والاستمتاع بها لا تعد ولا تحصي....
                        </Typography>
                    </CardContent>
                </Collapse>
            </Card>
            </Grid>
            <Grid item xs={12} md={6}>
            <Card sx={{ minWidth: '35%' }}>
                <CardMedia
                    component="img"
                    alt="green iguana"
                    height="300"
                    image="images/اوربا.jpg"
                />
                <CardContent>
                    <Typography gutterBottom variant="h5" component="div">
                    * اجمل الدول السياحية في شرق اوربا... 
                    </Typography>
                    <Typography gutterBottom variant="p" component="p">- لجأت بعض الجهات المسئولة في تصنيف دول شرق اوربا الي العديد من العوامل الجغرافية الطبيعة واعتمدت جهات اخري علي العوامل السياسية او الاختلاقات الثقافية او الدينية او التاريخية ولا يوجد تصنيف محدد وواضح ومتفق عليه. 
- ولكن عرفت بانها الدول التي يحدها بحر البلطيق وبارنتس في الشمال وبحر الاسود وبحر قزوين في الحنوب ويشير مصطلح دول شرق اوربا الي الدول الاوربية التي كانت تحكمها الانظمة الشيوعية وتوصل احصاء الامم المتحدة الي مجموعة من الدول التابعة لشرق اوربا " التشيك ، البوسنة والهرسك، اوكرانيا، بيلاروسيا ، بلغاريا ، رومانيا ،مولدوفا"
                    </Typography>
                </CardContent>
                <CardActions sx={{ display: "flex", justifyContent: "space-between" }}>
                    <Button size="small" sx={{ color: "#1473E6" }} onClick={() => setIsExpanded1(!isExpanded1)}>قراءة المزيد</Button>
                </CardActions>
                <Collapse
                    in={isExpanded1}
                    timeout="auto"
                    unmountOnExit
                >
                    <CardContent>
                        <Typography>
                            - " جمهورية التشيك " :- 
- دولة غير ساحلية توجد في القارة الاوربية يحدها بولندا من الشمال والمانيا من الشمال الغربي والنمسا من الجنوب وتعتبر من اصغر دول الاتحاد الاوربي وتعد منطقة جذب سياحي. 
2-" البوسنة والهرسك ":- 
- دول غير ساحلية لديها ساحل ضيق علي البحر الادرياتيكي يحدها من الشرق صربيا والجبل الاسود من الجنوب الشرقي ، تعتبر البوسنة اكبر جغرافيا لديها مناخ قاري معتدل مع صيف حار وشتاء بارد. 
بالنسبة للهرسك لديها مناخ بحر متوسط ومعظم التضاريس الجبلية ، وتشتهر البوسنة والهرسك اقليميا ودوليا ببيئتها الطبيعية وتراثها الثقافي الموروث من ست حضارات. 
3- " سلوفاكيا" :- 
- توجد في القارة الاوربية مع الحدود مع التشيك والنمسا من الغرب وبولندا من الشمال وأوكرانيا من الشرق والمجر من الجنوب وتعتبر غير ساحلية اما عاصمتها هي براتيسلافا وهي اكبر مدنها ولديها مناخ معتدل ذو رطوبة عالية صيفا وشتاء بارد مع هطول ثلجي كثيف. 
4- " مولدوفا ":- 
- دولة اوربية ذات نطام جمهوري غير ساحلية تقع في شرق اوربا غير معروفة علي الاطلاق 
استقلت في 991 بعد انهيار الاتحاد السوفيتي واصبحت دولة ديمقراطية.
 </Typography>
                    </CardContent>
                </Collapse>
            </Card>
            </Grid>
            <Grid item xs={12} md={6}>
            <Card sx={{ minWidth: '35%' }}>
                <CardMedia
                    component="img"
                    alt="green iguana"
                    height="300"
                    image="images/ماهو الكروز البحري.jpg"
                />
                <CardContent>
                    <Typography gutterBottom variant="h5" component="div">
                    * ماهو الكروز البحري :- 

                    </Typography>
                    <Typography gutterBottom variant="p" component="p">
                    - اصبح الابحار جزء رئيسي في مجال السياحة وبناء علي ذلك شهدت الموانئ للصناعات الحديثة عدد من سفن الكروز السياحي وتم بناؤها حديثا لتلبية احتياجات العملاء. 
وتستخدم سفن الكروز الضخمة العملاقة في الرحلات البحرية السياحية ورحلات المتعة والترفيه السياحي وتكون الرحلة نفسها ووسائل الراحة الخاصة جزء من التجربة. 
وتمتد هذه الرحلات الي 3 ليال او اكثر وممكن ان تستمر الي اسابيع وتمر بالركاب في موانئ مختلفة ولديها قدرات مختلفة لتخزين الوقود والطعام للاستهلاك في الرحلان الطويلة. 
                    </Typography>
                </CardContent>
                <CardActions sx={{ display: "flex", justifyContent: "space-between" }}>
                    <Button size="small" sx={{ color: "#1473E6" }} onClick={() => setIsExpanded2(!isExpanded2)}>قراءة المزيد</Button>
                </CardActions>
                <Collapse
                    in={isExpanded2}
                    timeout="auto"
                    unmountOnExit
                >
                    <CardContent>
                        <Typography>
                            - قبل السفر يجب عليك. ان تحدد اي رحلة كروز سوف تناسبك وتقوم باختيار تفاصيل الرحلة حسب الوجهة التي تريد الذهاب اليها والوقت المناسب لك ولاسرتك وعدد الاشخاص ايضا. 
- ويوجد مجموعة من الشركات التي سوف تساعدك علي اختيار رحلة الكروز المناسبة لك :-
- شركة ncl النرويجية :- ثاني اكبر اسطول مبدع في وجهات البحر المتوسط وبحر الشمال وتتميز بكثرة انواع الترفيه وهي خيار جيد للعوائل المتوسطة. 
- الرويال كريبان :- 
من اكبر الشركات في العالم علي الاطلاق سواء من ناحية الاسطول او حجم السفن ويعتبر سعرها مرتفع وخيار ممتاز لمن يبحث عن الاستجمام والراحة وتعد رائدة في مجال البحر الكاريبي. 
- البرنسس :- 
غالية التكلفة ويوجد بها وجهات خاصة وجميلة اسطولها حديث وتعتبر من الشركات القلائل التي يوجد بها رحلات لمدة طويلة. 
- الكرنفال :- 
تتميز بكثرة البرامج الشبابية عليها ولديها وجهات سفر غالية وتعتبر متوسطة التكلفة ومرغوبة بالنسبة للشباب 
- ديزني كروز :- 
يوجد بها انشطة والعاب لجميع الاعمار وتعتبر اسعارها من متوسط الي مرتفع ومحببة لمن يرغبون في ترفيه اولادهم. 
- كوستا :- 
محببة للمتزوجين حديثا ولكن قل الطلب عليها بعد حادثة غرق احدي سفنها واسعارها تتراوح بين المتوسط الي الرخيص. 
** افضل الرحلات البحرية :- 
الشركات السياحية الكبري المتخصصة تضع في اعتبارها متطلبات المسافر وتقدم عروض مختلفة تتناول الاسعار ونوعية الرحلة ، الرحلات في العادة تنطلق من البحر الكاريبي وجزر البهاما والمكسيك الي الصين وحنوب شرقي اسيا مثل بعثات  ليندبلاد :- هذه شركة استطاعت ان تجتذب السياح من كل اقطار العالم لما تنظمه من رحلات شواء وتعلم اعداد الطعام اعتمادا علي ثقافات مختلفة. 
** أجمل الوجهات السياحية :- اختيارك لرحلتك البحرية يرجع لاختيارك للشركة البحرية التي ترافقها حسب ميزانيتك ومن الممكن جدا ان تزور دولا واقطارا موانئ كثيرة بمال قليل. 
وكان يعرف الكروز البحري قديما بانه طريقة مثلي لسفر المتقاعدين والمسنين ولكن بعد تجربته من  قبل الشباب عبروا عن فرحتهم وسعادتهم بهده التجربة وتم اعتباره وسيلة سفر مثل ااطيران والقطار واصبح الكروز مناسب لجميع الأعمار والاجناس.  
** وسائل الترفيه البحري :- 
تطورت السياحية البحرية واستطاعت هذه السفن العائمة ان توفر لروادها انشطة وفعاليات وكل وسائل الراحة والاستجمام والمتعة وتحولات رحلات الكروز الي عروض تجذب الاسر والمراهقين ووفرت اجواء سياحية ممتازة وتروض تزلج علي الجليد والقغز بالمظلات وحفلات مع طواقم مختلفة تستطيع ان تمتعك بوقتك وتحولت هذه السفن الي منتجعات قائمة في البحر حاملة الالاف البشر. 
من لم يعش تجربة الكروز البحري ولم يحجز الي الان يجب ان يعيد التفكير نحو هذا النوع من السياحة والتنقل بين الموانئ الخلابة رحلة انت المدلل بها...
</Typography>
                    </CardContent>
                </Collapse>
            </Card>
            </Grid>
            <Grid item xs={12} md={6}>
            <Card sx={{ minWidth: '35%' }}>
                <CardMedia
                    component="img"
                    alt="green iguana"
                    height="300"
                    image="images/موستار.jpg"
                />
                <CardContent>
                    <Typography gutterBottom variant="h5" component="div">
                    ** السياحة في موستار 

                    </Typography>
                    <Typography gutterBottom variant="p" component="p">
                        - موستار مدينة ساحرة تقع بالقرب من دوبرفينك تشتهر في جميع انحاء العالم بسحرها الرائع ومناظرها الخلابة وتعتبر واحدة من اكثر الوجهات السياحية التي يمكن للسياح الوصول اليها ويوجد بها العديد من الأماكن السياحية الساحرة واشتهرت بسبب جسرها الذي دمر خلال الحرب الأهلية.
- اين تقع موستار :- 
هي عاصمة البوسنة والهرسك وخامس أكبر مدينة في البلاد وتقع علي بلد جبلي ويوجد بها جسر موستار " الجسر القديم " الذي كان سبب في شهرتها.

                    </Typography>
                </CardContent>
                <CardActions sx={{ display: "flex", justifyContent: "space-between" }}>
                    <Button size="small" sx={{ color: "#1473E6" }} onClick={() => setIsExpanded3(!isExpanded3)}>قراءة المزيد</Button>
                </CardActions>
                <Collapse
                    in={isExpanded3}
                    timeout="auto"
                    unmountOnExit
                >
                    <CardContent>
                        <Typography>
                        -جسر موستار : 
- هو رمز العمارة العثمانية ومن الجواهر التي تمتلكها مدينة موستار يبلغ طوله ٣٠ متر وعرضه حوالي ٤ أمتار وعلي ارتفاع ٢٠ متر علي نهر نيرتيفا وعلي يد المهندس المعماري هجر الدين.
اكتسب الجسر شهرته التي استقطبت من خلالها العديد من هواة القفز من مسافات عالية ليمارسوا هواياتهم المفضلة وسط تصفيق الجميع وتعرض الجسر الي القصف وتم تدمير اجزاء كبيرة منه وتم استخدام ٤٥٦ كتلة حجرية لإعادة بناء الجسر ووجوده أظهر تقليد قديم وهو قفز الشباب الراغبون في الزواج الي النهر تعبيرا عن حبهم وشجعاتهم وكان هذا التقليد يتم بناء علي طلب اباء الفتيات واستمر لفترة من الزمن .
 ٢-مسجد كوسكي محمد باشا 
مسجد اثري يقع في قلب مدينة موستار حيث يودي المسلمون صلاتهم عند دخولك الجزء الداخلي للمسجد ستجد سجاد موهوب من الامبراطور النمساوي وعند صعود المئذنة ستتاح لك الفرصة لمشاهدة منظر فريد ولكن تضرر المسجد من الهجوم الذي حدث من الجنود الكروات وأصبح غير صالح للاستخدام وتم إعادة بنائه مرة أخري
٣- بيت بيسيفيكا
منزل آخر من الفترة العثمانية يجذب انتباه المسافرين حيث يقع علي الضفة الغربية لنهر نيرتيفا 
مكون من طابقين وتم تصميم المطبخ بشكل منفصل في الحديقة حتي تستطيع المرأة الحركة بحرية في فصل الصيف 
النوافذ ذات أبعاد صغيرة ويمكن روية العناصر التي تعكس الفترة لجميع اجزاء المبني 
٤- مسجد كاراجوز بك 
تم إضافته الي قائمة الأماكن السياحية في موستار بسبب ميزاته المعمارية وليس تاريخه وتم بنائه تحت إشراف معمار سنان 
نجي هذا المسجد أثناء الحرب العالمية الثانية بأضرار طفيفة ولكن خلال الحرب الأهلية أصبح غير صالح للاستخدام وخلال السنوات التالية لهذه الحروب تم إعادة بناؤه ويعكس هذا المعمار نجاح الطراز المعماري العثماني الفريد
 </Typography>
                    </CardContent>
                </Collapse>
            </Card>
            </Grid>
        </Grid>
            

            

            

            

        </Stack>

    );
}