import { Box, CardMedia, Container, Typography } from '@mui/material'
import imgBlog from '../assetss/اوربا.jpg'
import React from 'react'

function CardBlogDesc() {
    return (
        <Box>
            <CardMedia
                            component="img"
                            alt="green iguana"
                            height="300"
                            
                            image={imgBlog}
                            sx={{ width:{md:"50%",xs:"100%" }, margin: "auto" }}
                        />
            <Container
                sx={{
                    mt: 4,
                    mb: 4,
                }}
            >
                <Typography variant="h3" component="h3" fontWeight={"bold"} color={"#F4981D"} textAlign={"center"} mb={8}>
                    
                        * اجمل الدول السياحية في شرق اوربا...
                    
                </Typography>
                <Typography
                    variant="p"
                    sx={{
                        mb: 5,
                    }}
                >- لجأت بعض الجهات المسئولة في تصنيف دول شرق اوربا الي العديد من العوامل الجغرافية الطبيعة واعتمدت جهات اخري علي العوامل السياسية او الاختلاقات الثقافية او الدينية او التاريخية ولا يوجد تصنيف محدد وواضح ومتفق عليه. 
                - ولكن عرفت بانها الدول التي يحدها بحر البلطيق وبارنتس في الشمال وبحر الاسود وبحر قزوين في الحنوب ويشير مصطلح دول شرق اوربا الي الدول الاوربية التي كانت تحكمها الانظمة الشيوعية وتوصل احصاء الامم المتحدة الي مجموعة من الدول التابعة لشرق اوربا " التشيك ، البوسنة والهرسك، اوكرانيا، بيلاروسيا ، بلغاريا ، رومانيا ،مولدوفا" 
                <ol>
                    <li>
                        <h3>- جمهورية التشيك  :- </h3>

                    </li>
                    <p>- دولة غير ساحلية توجد في القارة الاوربية يحدها بولندا من الشمال والمانيا من الشمال الغربي والنمسا من الجنوب وتعتبر من اصغر دول الاتحاد الاوربي وتعد منطقة جذب سياحي. </p>
                    <li><h3>-" البوسنة والهرسك ":- 
</h3>
<p>- دول غير ساحلية لديها ساحل ضيق علي البحر الادرياتيكي يحدها من الشرق صربيا والجبل الاسود من الجنوب الشرقي ، تعتبر البوسنة اكبر جغرافيا لديها مناخ قاري معتدل مع صيف حار وشتاء بارد. 
بالنسبة للهرسك لديها مناخ بحر متوسط ومعظم التضاريس الجبلية ، وتشتهر البوسنة والهرسك اقليميا ودوليا ببيئتها الطبيعية وتراثها الثقافي الموروث من ست حضارات. 
</p>

</li>
                    <li> <h3>- " سلوفاكيا" :- 
</h3>
<p>- توجد في القارة الاوربية مع الحدود مع التشيك والنمسا من الغرب وبولندا من الشمال وأوكرانيا من الشرق والمجر من الجنوب وتعتبر غير ساحلية اما عاصمتها هي براتيسلافا وهي اكبر مدنها ولديها مناخ معتدل ذو رطوبة عالية صيفا وشتاء بارد مع هطول ثلجي كثيف. 
</p>
 </li>
                    <li><h3>- " مولدوفا ":- 
</h3>
<p>- دولة اوربية ذات نطام جمهوري غير ساحلية تقع في شرق اوربا غير معروفة علي الاطلاق 
استقلت في 991 بعد انهيار الاتحاد السوفيتي واصبحت دولة ديمقراطية.</p>
</li>
                </ol>
                </Typography>
            </Container>
        </Box>
    )
}

export default CardBlogDesc