import { Box, CardMedia, Container, Typography } from '@mui/material'
import React from 'react'
import imgBlog from '../assetss/موستار.jpg'

function CardBlogDescMostar() {
    return (
        <Box>
            <CardMedia
                component="img"
                alt="green iguana"
                height="300"

                image={imgBlog}
                style={{ width: "50%", margin: "auto" }}
            />
            <Container
                sx={{
                    mt: 4,
                    mb: 4,
                }}
            >
                <Typography variant="h3" component="h3" fontWeight={"bold"} color={"#F4981D"} textAlign={"center"} mb={8}>

                    ** السياحة في موستار

                </Typography>
                <Typography
                    variant="p"
                    sx={{
                        mb: 5,
                    }}
                >- موستار مدينة ساحرة تقع بالقرب من دوبرفينك تشتهر في جميع انحاء العالم بسحرها الرائع ومناظرها الخلابة وتعتبر واحدة من اكثر الوجهات السياحية التي يمكن للسياح الوصول اليها ويوجد بها العديد من الأماكن السياحية الساحرة واشتهرت بسبب جسرها الذي دمر خلال الحرب الأهلية.
                    - اين تقع موستار :-
                    هي عاصمة البوسنة والهرسك وخامس أكبر مدينة في البلاد وتقع علي بلد جبلي ويوجد بها جسر موستار " الجسر القديم " الذي كان سبب في شهرتها.
                    <ol>
                        <li>
                            <h3>-جسر موستار : </h3>

                        </li>
                        <p>
                            - هو رمز العمارة العثمانية ومن الجواهر التي تمتلكها مدينة موستار يبلغ طوله ٣٠ متر وعرضه حوالي ٤ أمتار وعلي ارتفاع ٢٠ متر علي نهر نيرتيفا وعلي يد المهندس المعماري هجر الدين.
                            اكتسب الجسر شهرته التي استقطبت من خلالها العديد من هواة القفز من مسافات عالية ليمارسوا هواياتهم المفضلة وسط تصفيق الجميع وتعرض الجسر الي القصف وتم تدمير اجزاء كبيرة منه وتم استخدام ٤٥٦ كتلة حجرية لإعادة بناء الجسر ووجوده أظهر تقليد قديم وهو قفز الشباب الراغبون في الزواج الي النهر تعبيرا عن حبهم وشجعاتهم وكان هذا التقليد يتم بناء علي طلب اباء الفتيات واستمر لفترة من الزمن .
                        </p>
                        <li><h3>-" -مسجد كوسكي محمد باشا

                        </h3>
                            <p>مسجد اثري يقع في قلب مدينة موستار حيث يودي المسلمون صلاتهم عند دخولك الجزء الداخلي للمسجد ستجد سجاد موهوب من الامبراطور النمساوي وعند صعود المئذنة ستتاح لك الفرصة لمشاهدة منظر فريد ولكن تضرر المسجد من الهجوم الذي حدث من الجنود الكروات وأصبح غير صالح للاستخدام وتم إعادة بنائه مرة أخري
                            </p>

                        </li>
                        <li> <h3>- بيت بيسيفيكا
                        </h3>
                            <p>منزل آخر من الفترة العثمانية يجذب انتباه المسافرين حيث يقع علي الضفة الغربية لنهر نيرتيفا
                                مكون من طابقين وتم تصميم المطبخ بشكل منفصل في الحديقة حتي تستطيع المرأة الحركة بحرية في فصل الصيف
                                النوافذ ذات أبعاد صغيرة ويمكن روية العناصر التي تعكس الفترة لجميع اجزاء المبني</p>
                        </li>
                        <li><h3> مسجد كاراجوز بك
                        </h3>
                            <p>تحت إشراف معمار سنان
                                نجي هذا المسجد أثناء الحرب العالمية الثانية بأضرار طفيفة ولكن خلال الحرب الأهلية أصبح غير صالح للاستخدام وخلال السنوات التالية لهذه الحروب تم إعادة بناؤه ويعكس هذا المعمار نجاح الطراز المعماري العثماني الفريد</p>
                        </li>
                    </ol>
                </Typography>
            </Container>
        </Box>
    )
}

export default CardBlogDescMostar