import React from 'react'
import { Box, CardMedia, Container, Typography } from '@mui/material'
import imgBlog from '../assetss/ماهو الكروز البحري.jpg'

function CardBlogDescBhre() {
    return (
        <Box>
            <CardMedia
                component="img"
                alt="green iguana"
                height="300"

                image={imgBlog}
                sx={{ width:{md:"50%",xs:"100%" }, margin: "auto" }}
            />
            <Container
                sx={{
                    mt: 4,
                    mb: 4,
                }}
            >
                <Typography variant="h3" component="h3" fontWeight={"bold"} color={"#F4981D"} textAlign={"center"} mb={8}>

                    * ماهو الكروز البحري :-


                </Typography>
                <Typography
                    variant="p"
                    sx={{
                        mb: 5,
                    }}
                >- اصبح الابحار جزء رئيسي في مجال السياحة وبناء علي ذلك شهدت الموانئ للصناعات الحديثة عدد من سفن الكروز السياحي وتم بناؤها حديثا لتلبية احتياجات العملاء.
                    وتستخدم سفن الكروز الضخمة العملاقة في الرحلات البحرية السياحية ورحلات المتعة والترفيه السياحي وتكون الرحلة نفسها ووسائل الراحة الخاصة جزء من التجربة.
                    وتمتد هذه الرحلات الي 3 ليال او اكثر وممكن ان تستمر الي اسابيع وتمر بالركاب في موانئ مختلفة ولديها قدرات مختلفة لتخزين الوقود والطعام للاستهلاك في الرحلان الطويلة.
                    ** حدد مطالبك :-
                    - قبل السفر يجب عليك. ان تحدد اي رحلة كروز سوف تناسبك وتقوم باختيار تفاصيل الرحلة حسب الوجهة التي تريد الذهاب اليها والوقت المناسب لك ولاسرتك وعدد الاشخاص ايضا.
                    - ويوجد مجموعة من الشركات التي سوف تساعدك علي اختيار رحلة الكروز المناسبة لك :-
                    - شركة ncl النرويجية :- ثاني اكبر اسطول مبدع في وجهات البحر المتوسط وبحر الشمال وتتميز بكثرة انواع الترفيه وهي خيار جيد للعوائل المتوسطة.
                    <ol>
                        <li>
                            <h3>- - الرويال كريبان :- </h3>

                        </li>
                        <p>
                            من اكبر الشركات في العالم علي الاطلاق سواء من ناحية الاسطول او حجم السفن ويعتبر سعرها مرتفع وخيار ممتاز لمن يبحث عن الاستجمام والراحة وتعد رائدة في مجال البحر الكاريبي.
                        </p>
                        <li><h3>- البرنسس :-
                        </h3>
                            <p>غالية التكلفة ويوجد بها وجهات خاصة وجميلة اسطولها حديث وتعتبر من الشركات القلائل التي يوجد بها رحلات لمدة طويلة. </p>

                        </li>
                        <li> <h3>- الكرنفال :-

                        </h3>
                            <p>تتميز بكثرة البرامج الشبابية عليها ولديها وجهات سفر غالية وتعتبر متوسطة التكلفة ومرغوبة بالنسبة للشباب
                            </p>
                        </li>
                        <li><h3>- ديزني كروز :-

                        </h3>
                            <p>يوجد بها انشطة والعاب لجميع الاعمار وتعتبر اسعارها من متوسط الي مرتفع ومحببة لمن يرغبون في ترفيه اولادهم.
                            </p>
                        </li>
                        <li><h3>- كوستا :- 
                        </h3>
                            <p>محببة للمتزوجين حديثا ولكن قل الطلب عليها بعد حادثة غرق احدي سفنها واسعارها تتراوح بين المتوسط الي الرخيص. </p>
                        </li>
                    </ol>
                    <Typography variant="h3" component="h3" fontWeight={"bold"} color={"#F4981D"} textAlign={"center"} mb={8}>

                    ** افضل الرحلات البحرية :- 

                </Typography>
                <Typography
                    variant="p"
                    sx={{
                        mb: 5,
                    }}
                >الشركات السياحية الكبري المتخصصة تضع في اعتبارها متطلبات المسافر وتقدم عروض مختلفة تتناول الاسعار ونوعية الرحلة ، الرحلات في العادة تنطلق من البحر الكاريبي وجزر البهاما والمكسيك الي الصين وحنوب شرقي اسيا مثل بعثات  ليندبلاد :- هذه شركة استطاعت ان تجتذب السياح من كل اقطار العالم لما تنظمه من رحلات شواء وتعلم اعداد الطعام اعتمادا علي ثقافات مختلفة. 
                ** أجمل الوجهات السياحية :- اختيارك لرحلتك البحرية يرجع لاختيارك للشركة البحرية التي ترافقها حسب ميزانيتك ومن الممكن جدا ان تزور دولا واقطارا موانئ كثيرة بمال قليل. 
                وكان يعرف الكروز البحري قديما بانه طريقة مثلي لسفر المتقاعدين والمسنين ولكن بعد تجربته من  قبل الشباب عبروا عن فرحتهم وسعادتهم بهده التجربة وتم اعتباره وسيلة سفر مثل ااطيران والقطار واصبح الكروز مناسب لجميع الأعمار والاجناس.  
                ** وسائل الترفيه البحري :- 
                تطورت السياحية البحرية واستطاعت هذه السفن العائمة ان توفر لروادها انشطة وفعاليات وكل وسائل الراحة والاستجمام والمتعة وتحولات رحلات الكروز الي عروض تجذب الاسر والمراهقين ووفرت اجواء سياحية ممتازة وتروض تزلج علي الجليد والقغز بالمظلات وحفلات مع طواقم مختلفة تستطيع ان تمتعك بوقتك وتحولت هذه السفن الي منتجعات قائمة في البحر حاملة الالاف البشر. 
                من لم يعش تجربة الكروز البحري ولم يحجز الي الان يجب ان يعيد التفكير نحو هذا النوع من السياحة والتنقل بين الموانئ الخلابة رحلة انت المدلل بها...</Typography>
                </Typography>
            </Container>
        </Box>
    )
}

export default CardBlogDescBhre