import React from 'react'
import { Box, CardMedia, Container, Typography } from '@mui/material'
import imgBlog from '../assetss/رحلتك.jpg'

function CardBlogDescBar() {
    return (
        <Box>
            <CardMedia
                component="img"
                alt="green iguana"
                height="300"

                image={imgBlog}
                sx={{ width:{md:"50%",xs:"100%" }, margin: "auto" }}
            />
            <Container
                sx={{
                    mt: 4,
                    mb: 4,
                }}
            >
                <Typography variant="h3" component="h3" fontWeight={"bold"} color={"#F4981D"} textAlign={"center"} mb={8}>

                    * أفضل الاماكن السياحية في برشلونة...

                </Typography>
                <Typography
                    variant="p"
                    sx={{
                        mb: 5,
                    }}
                >تعتبر مدينة برشلونة هي الوجهة الأكثر شعبية في اسبانيا بسبب ماتتمتع به من مقومات سياحية كثيرة ومناظر خلابة تجذب الزوار اليها وسنقوم فيما يلي بعرض لافضل الاماكن السياحية التي يمكن زيارتها. "
                    <ol>
                        <li>
                            <h3>- " حديقة جويل" :- </h3>

                        </li>
                        <p>- تحفة معمارية من تصميم المهندس المعماري الكاتالوني " انتوني غاودي " وتعتبر من اجمل الاماكن السياحية في برشلونة ويحتوي مجموعة من الحدائق وينصح بزيارته علي وجه الخصوص ويمكن ان تبدأ نهارك فيه بجولة في ارجاء الحديقة والاستمتاع بمساحتها الخضراء والمنحوتات ذات الطراز الفريد وتيتح الحديقة مناظر بانورامية تفوق الجمال الدخول هناك مجانيا ويوجد ايضا مقاهي ومطعم ومتجر للهدايا وحمامات عامة.  </p>
                        <li><h3>- " حديقة حيوان برشلونة":

                        </h3>
                            <p>- تعتبر من أبرز المعالم السياحية باقليم كاتالونيا وموجود بها اكثر من 4 الاف حيوان " النمور, الاسود، الافيال، الدببة ،الغزلان " وتعتبر خيار ممتاز لمن يبحث عن مكان سياحي للاطفال ويمكنك عمل جولة استكشافية للاستمتاع بالمساحات الخضراء حول ارجاء الحديقة والتعرف علي الحيوانات الموجودة والطيور الجميلة التي تجذب الزوار.
                                وحدود المتعة لاتنتهي عند المشاهدة فقط ولكن يمكن التفاعل ايضا مع الحيوانات والتقاط الصور معهم.
                            </p>

                        </li>
                        <li> <h3>- " ملاهي ايلا فانتاسيا المائية ":-

                        </h3>
                            <p>عند زيارتك برشلونة يتوجب عليك الذهاب الي هذة الملاهي لانها تعتبر مكان رائع يوجد به بعض الالعاب الشيقة علي مساحات واسعة ويوجد بها ايضا بعض الاماكن المخصصة للشواء ومطاعم ومقاهي متنوعة ويتوفر بها كافة وسائل المتعة.

                            </p>
                        </li>
                        <li><h3> " منتزة كوزموكايك " :-

                        </h3>
                            <p>يسمي متحف العلوم في مدينة برشلونة ويعد واحد من اهم المتاحف المتنوعة يحتوي اربع اقسام بها معارض مختلفة " قسم الغالات المغمورة، حائط بيولوجي ، غرفة مواد، قبة سماوية " .
                                يمكنك من قضاء وقت ترفيهي وتعليمي في ذات الوقت ويعرض المعلومات بطريقة غريبة واسلوب تفاعلي وشيق ومناسب لجميع الفئات العمرية.
                                ويوجد في برشلونة الكثير من الاماكن السياحية الاخري والترفيهية التي يمكن زيارتها والاستمتاع بها لا تعد ولا تحصي....</p>
                        </li>
                    </ol>
                </Typography>
            </Container>
        </Box>
    )
}

export default CardBlogDescBar