import { Grid } from "@mui/material";
import React from "react";
import Testimonials from "./Testimonials";

function TestimonialsList() {
    return (
        <Grid container spacing={3}>
            <Grid item xs={12} md={6}>
                <Testimonials name={'محمد خالد'} state={'عميل سابق'} desc={`تعاملة في رحلتي مع الاستاذ احمد فؤاد تواصل هاتفي فقط ولم يسبق ان حضرت للمكتب وكفاني ذلك كانت رحلتي الى موريشيوس العودة قبل للامانه يستحق الشكر والثاء وبالاضافة الى الترتيب والحجز والعمل كامل والكامل سبحانه لك اواجه اي اختلاف عن الكلام أو تقصيرر والتواصل مستمر منه شخصي من الاقلاع حتى العودة لم ينقطع التواصل
مع بصرااااحة لوفيه اعلى من ذلك تقييم أعطيته`} />
            </Grid>
            <Grid item xs={12} md={6}>
                <Testimonials name={'محمد كامل'} state={'عميل جديد'} desc={`تجربه جدا جميلة وراحه في السفر السواق والفنادق والتوقيت ونرونه في التعامل شكراً كمان للاخ احمد فؤاد كان مرة محتمل استفساراتي حصلت معاي مشكله وانا بالمطار تم الغاء الرحلة من قبل الناقل الجوي ماقصر احمد تدخل وظبط لي الحجوزات والفنادق عشان ماتروح علي تجربة تتكرر مره ثانيه`}/>
            </Grid>
        </Grid>
    );
}

export default TestimonialsList;
